print ("Добро пожаловать в приключенческую игру! Вы находитесь перед замком, который охраняет стражник.")
name = input("Введите ваше имя: ")




print("привет, " + name + "! Стражник преградил тебе путь для входа в замок. Скажи пароль.")

# начало игры 

password = ""

while password != "дракон":
    password = input("Введите пароль: ")
    
    if password == "дракон":
        print("Стражник вас пропускает и вы заходите в замок!")
    else:
        print("Стражник вас не пропускает. Попробуйте снова.")

print("Вы внутри замка.") 
print ("Вы видите перед собой три двери с номерами 1, 2 и 3.")
door = input ("Выберите дверь (напишите 1, 2 или 3):")
print ("Вы выбрали дверь номер " + door + ".")
if door == "1":
    print ("вы увидели большого монстра и он вас съел. Игра окончена.")
elif door == "2":
    print ("вы увидели короля вы не понравились королю и он вас казнил. Игра окончена.")
elif door == "3":
    print ("вы увидели сундук с сокровищами. Вы выиграли!")
elif door == "4":
    print ("Вы нашли тайную комнату! Там лежит корона дракона. Это секретная победа!")
else:
    print ("Такой двери нет. Игра окончена.")
